In [1]:
import pandas as pd
d=pd.read_excel("duplicate.xlsx")
df=pd.DataFrame(d)
print(df)

   Name  Eng  Maths  Sci  Total
0     a   33     56   77    166
1     s   35     66   79    180
2     d   36     33   81    150
3     e   37     86   83    206
4    gh   38     96   33    167
5     j   39     33   87    159
6    kk   40    116   89    245
7    gh   38     96   33    167
8     e   37     86   83    206
9    gh   38     96   33    167
10    a   33     56   77    166

In [2]:
df.loc[df['Total']<170]

   Name  Eng  Maths  Sci  Total
0     a   33     56   77    166
2     d   36     33   81    150
4    gh   38     96   33    167
5     j   39     33   87    159
7    gh   38     96   33    167
9    gh   38     96   33    167
10    a   33     56   77    166

In [7]:
df.loc[(df['Eng']> 38) & (df['Maths']<50)]

  Name  Eng  Maths  Sci  Total
5    j   39     33   87    159

In [8]:
df.loc[(df['Eng']> 38) | (df['Maths']<50)]

  Name  Eng  Maths  Sci  Total
2    d   36     33   81    150
5    j   39     33   87    159
6   kk   40    116   89    245

In [9]:
df.loc[df['Name'].str.contains("k")]

  Name  Eng  Maths  Sci  Total
6   kk   40    116   89    245

In [10]:
df.loc[df['Name'].str.startswith("k")]

  Name  Eng  Maths  Sci  Total
6   kk   40    116   89    245

In [11]:
df.loc[df['Name'].str.endswith("k")]

  Name  Eng  Maths  Sci  Total
6   kk   40    116   89    245